Repository: creifenscheid/cleanup_tools
Catalog: Resources/Private/Language/*.locallang_mod.xlf
Languages: de, is

# tx_splcleanuptools.general.executioncontext.0
source: BE module
is: Stuðningseiningar

# tx_splcleanuptools.general.executioncontext.1
source: Toolbar
is: Tækjastikan

# tx_splcleanuptools.general.executioncontext.2
source: Scheduler
is: Tímaáætlun

# tx_splcleanuptools.general.executioncontext.3
source: Content item
is: Efnisatriði

# tx_splcleanuptools.general.executioncontext.4
source: After database operation
is: Eftir aðgerð gagnagrunnsins

# tx_splcleanuptools.general.state.error
source: error
is: villa

# tx_splcleanuptools.general.state.ok
source: ok
is: allt í lagi

# label.yes
source: Yes, please.
de: Ja, bitte.
is: Já endilega.

# label.no
source: No, thank you.
de: Nein, danke.
is: Nei takk.

# tx_splcleanuptools.general.inExectionContext
source: in "%s" context
is: í "%s" samhengi

# module.menu.history
source: History
de: Rückblick
is: Saga

# module.lastLog.days
source: executed %s days ago
de: vor %s Tagen ausgeführt
is: keyrð út fyrir %s dögum

# module.lastLog.yesterday
source: executed yesterday
de: gestern ausgeführt
is: tekinn af lífi í gær

# module.lastLog.today
source: executed today, %s
de: heute um %s ausgeführt
is: keyrð í dag, %s

# module.lastLog.user
source: by
de: von
is: eftir

# module.notProcessed
source: not executed so far
de: bisher nicht ausgeführt
is: ekki framkvæmt hingað til

# module.submit
source: Clean up
de: Ausführen
is: Hreinsið upp

# module.history.headline
source: History
de: Rückblick
is: Saga

# module.history.th.date
source: Date
de: Datum
is: Dagsetning

# module.history.th.service
source: Service
is: Þjónusta

# module.history.th.parameter
source: Parameter
is: Breytir

# module.history.th.user
source: User
de: Nutzer
is: Notandi

# module.history.th.executionContext
source: Execution context
de: Kontext
is: Framkvæmdarsamhengi

# module.history.th.state
source: State
de: Status
is: Ríki

# module.history.th.messages
source: Messages
de: Nachrichten
is: Skilaboð

# module.history.cleanupForm.label.logLiftime
source: Delete logs older then:
de: Log-Einträge löschen, die älter sind als:
is: Eyða annálum eldri:

# module.history.cleanupForm.label.dropAlreadyDeleted
source: Drop entries marked as deleted
is: Sendu færslur merktar sem eytt

# module.history.cleanupForm.label.submit
source: Clean up
de: Ausführen
is: Hreinsið upp

# tasks.cleanup.description
source: Various tools to cleanup your TYPO3.
de: Unterschiedlichste Werkzeuge zur Bereining der TYPO3-Installation
is: Ýmis tæki til að hreinsa TYPO3 þinn.

# tasks.cleanup.fields.serviceToProcess
source: Which service shall be executed?
de: Welcher Service soll ausgeführt werden?
is: Hvaða þjónusta skal framkvæmd?

# tasks.cleanup.information
source: Configured service:
de: Konfigurierter Service
is: Stillt þjónusta:

# drawitemhook.message
source: The flexform of this element is not valid and needs to be cleaned up.
is: Sveigjanleiki þessa frumefnis er ekki í gildi og þarf að hreinsa hann upp.

# messages.fallback.headline
source: CleanupTools says
de: CleanupTools sagt:
is: CleanupTools segir

# messages.error.headline
source: Oops
de: Huch
is: Úps

# messages.error.message
source: Execution of class "%s" was not successfull.
de: Das Ausgühren des Service "%s" war nicht erfolgreich.
is: Framkvæmd bekkjarins "%s" heppnaðist ekki.

# messages.success.message
source: Execution was successfull.
de: Die Ausführung war erfolgreich.
is: Framkvæmdin tókst vel.

# messages.error.message.no-method
source: No method was set.
de: Es wurde keine Methode konfiguriert.
is: Engin aðferð var sett.

# messages.error-services.message
source: In the following services, the execute function is missing: %s.
de: In den folgenden Servicen fehlt die "execute"-Funktion
is: Í eftirfarandi þjónustu vantar keyrsluaðgerðina:%s

# messages.error-services.headline
source: Watch out
de: Achtung
is: Passaðu þig

# messages.hook.warning.headline
source: Watch out
de: Achtung
is: Passaðu þig

# message.hook.warning.message
source: The flexform optimizer had some problems while updating the flexform field with the cleaned flexform. Your changes are saved, but the flexform might be not well formed.
is: Fínstillir flexform áttu í nokkrum vandræðum við uppfærslu flexform reitsins með hreinsuðu flexforminu. Breytingar þínar eru vistaðar, en sveigjanleg form er hugsanlega ekki vel mótuð.

# aria.history.togglebutton
source: Show/hide log messages.
de: Anzeigen/Ausblenden von Lig-Nachrichten.
is: Sýna / fela annálskilaboð.

# tx_cleanuptools.general.executioncontext.0
source: BE module
de: Backend-Modul

# tx_cleanuptools.general.executioncontext.1
source: Toolbar
de: Werkzeugleiste

# tx_cleanuptools.general.executioncontext.2
source: Scheduler
de: Planer

# tx_cleanuptools.general.executioncontext.3
source: Content item
de: Inhaltselement

# tx_cleanuptools.general.executioncontext.4
source: After database operation
de: DB-Hook

# tx_cleanuptools.general.state.error
source: error
de: fehlgeschlagen

# tx_cleanuptools.general.inExectionContext
source: in "%s" context Cleanup Tools
de: in "%s"-Kontext Cleanup Tools

# tasks.error.noServices
source: No services configured
de: Es sind keine Services konfiguriert.

# previewRenderer.message
source: The flexform of this element is not valid and needs to be cleaned up.
de: Die FlexForm des Elementes ist nicht valide und sollte bereinigt werden

# message.hook.warning.message
source: The flexform optimizer had some problems while updating the flexform field with the cleaned flexform. Your changes are saved, but the flexform might be not well formed.
de: Bei der Bereinigung der FlexForm kam es zu Problemen. Änderungen wurden gespeichert, jedoch besteht die Möglichkeit einer nicht validen FlexForm.

# aria.previewRenderer.cleanup
source: Clean up flexform.
de: Flexform aufräumen.
