Repository: creifenscheid/cleanup_tools
Catalog: Resources/Private/Language/*.locallang_services.xlf
Languages: is

# description.CleanFlexFormsService
source: Checks if TCA records with a FlexForm includes values that don't match the connected FlexForm value
is: Athugar hvort TCA skrár með FlexForm innihalda gildi sem passa ekki við tengda FlexForm gildi

# description.DeletedRecordsService
source: Force-deletes all records in the database which have a deleted=1 flag
is: Eyðir öllum skrám í gagnagrunninum sem hefur eytt = 1 fána

# description.LostFilesService
source: Finds files within uploads/ which are not needed anymore
is: Finnur skrár sem hafa verið hlaðið inn / sem ekki er þörf lengur

# description.OrphanRecordsService
source: Finds (and fixes) all records that have an invalid / deleted page ID
is: Finnur (og lagfærir) allar skrár sem hafa ógilt / eytt auðkenni síðu

# label.updateRefindex
source: Update reference index
is: Uppfæra viðmiðunarvísitölu

# label.recordUid
source: Record uid
is: Taktu upp uid

# label.pid
source: Page uid
is: Síðu uid

# label.depth
source: Depth
is: Dýpt

# label.dryRun
source: Dry run
is: Þurrt hlaup

# label.exclude
source: Paths that should be excluded
is: Stígar sem ætti að útiloka

# label.customPath
source: Paths to process (default: uploads)
is: Slóð til að vinna úr (sjálfgefið: uploads)

# module.history.cleanupForm.label.logLiftime.1-day
source: 1 day
is: 1 dagur

# module.history.cleanupForm.label.logLiftime.1-week
source: 1 week
is: 1 vika

# module.history.cleanupForm.label.logLiftime.1-month
source: 1 month
is: 1 mánuður

# module.history.cleanupForm.label.logLiftime.3-months
source: 3 months
is: 3 mánuðir

# module.history.cleanupForm.label.logLiftime.6-months
source: 6 months
is: 6 mánuðir

# module.history.cleanupForm.label.logLiftime.1-year
source: 1 year
is: 1 ár
